export default {
    'ui': {
        "general": {
            "select": {
                "yes": "✅是",
                "no": "❌否",
                "unknown": "❓不知道"
            },
            "resetAll": "重置當前頁面數據",
            "save": "儲存",
        },
        "title": "包容性衛生間項目-資料採集工具",
        "unsupported_browser": "您當前使用的瀏覽器不支援獲取GPS位置資訊，請更換瀏覽器後重試。",
        "gps": {
            "title": "🛰️位置資訊",
            "check_permission": "獲取GPS座標失敗，請檢查是否授予位置資訊權限。",
            "location": {
                "access_gps_location_btn": "獲取當前 GPS 座標",
                "longitude": "經度",
                "latitude": "緯度",
                "accuracy": "精確度",
                "meter": "米",
                "delta": "距離上次獲取"
            },
            "acquire": {
                "gps_no_data": "未獲取GPS資訊",
                "gps_expired": "GPS資訊可能過期"
            },
            "status": {
                "failed": "❌未獲取",
                "success": "✅已獲取",
                "outdated": "⚠️可能過時",
                "low_accuracy": "⚠️精度不足"
            }
        },
        "time": {
            "title": "🕘️開放時間",
            "create": "創建",
            "remove": "移除",
            "is24Hour": {
                "true": "全天開放✅",
                "false": "部分時段開放❌"
            },
            "waiting": "等待中...",
            "seconds_ago": "秒前",
            "minutes_ago": "分鐘前",
            "hours_ago": "小時前",
            "seconds": "秒"
        },
        "photo": {
            "title": "📷添加照片",
        },
        "toilet_type": {
            "title": "🈂️提供的衛生間服務",
            "binary": "🚻二元性別",
            "accessible": "♿第三/無障礙衛生間",
            "unisex": "無性別衛生間",
            "undefined": "其他"
        },
        "accessible_extend": {
            "title": "第三衛生間-附加資訊",
            "isLocked": "🔒是否被鎖上？",
            "isInBinary": "🚻是否位於男女衛生間內？"
        },
        "comments": {
            "title": "✏️備註"
        },
        "metadata": {
            "title": "ℹ️額外資訊",
            "isFree": "🆓是否免費？",
            "isPrivateProperty": "🏨是否位於私家區域（例如單位、公司內部）？",
            "hasHook": "👚有無掛衣鈎？",
            "hasMirror": "🪞有無鏡子？",
            "hasDryer": "🌀有無吹風機？",
            "recommendation_title": "⭐推薦程度"
        }
    }
};
