export default {
    "metadata": {
        "lastUpdate": "2024-03-21",
        "translators": [
            'OpenAI-ChatGPT4'
        ]
    },
    'ui': {
        "slogan":"不要向焦慮跟抑鬱投降，這個世界最後一定有我們存在的地方。",
        "general": {
            "select": {
                "yes": "✅是的",
                "no": "❌不是",
                "unknown": "❓不確定"
            },
            "resetAll": "重設目前頁面的資料",
            "save": "儲存",
        },
        "title": "包容性廁所計畫-資料收集工具",
        "unsupported_browser": "您目前使用的瀏覽器不支援取得GPS定位訊息，請換成其他瀏覽器再試一次。",
        "gps": {
            "title": "🛰️位置資訊",
            "check_permission": "取得GPS座標失敗，請檢查是否已授予位置資訊的權限。",
            "location": {
                "access_gps_location_btn": "取得目前的GPS座標",
                "acquiring_gps_location_btn": "取得中...",
                "longitude": "經度",
                "latitude": "緯度",
                "accuracy": "精準度",
                "meter": "公尺",
                "delta": "自上次取得"
            },
            "acquire": {
                "gps_no_data": "未取得GPS資訊",
                "gps_expired": "⚠️GPS資訊可能過期"
            },
            "status": {
                "failed": "❌未取得",
                "success": "✅已取得",
                "outdated": "⚠️可能過時",
                "low_accuracy": "⚠️精準度不足"
            }
        },
        "time": {
            "title": "🕘️開放時間",
            "create": "新增",
            "remove": "移除",
            "is24Hour": {
                "true": "全天候開放✅",
                "false": "部分時段開放❌"
            },
            "waiting": "等待中...",
            "seconds_ago": "秒前",
            "minutes_ago": "分鐘前",
            "hours_ago": "小時前",
            "seconds": "秒"
        },
        "photo": {
            "title": "📷照片",
        },
        "toilet_type": {
            "title": "🈂️提供的廁所服務",
            "binary": "🚻男女分廁",
            "accessible": "♿無障礙廁所",
            "unisex": "無性別廁所",
            "undefined": "其他"
        },
        "accessible_extend": {
            "title": "無障礙廁所-附加資訊",
            "isLocked": "🔒是否上鎖？",
            "isInBinary": "🚻是否位於男女分廁內？"
        },
        "comments": {
            "title": "✏️備註"
        },
        "metadata": {
            "title": "ℹ️額外資訊",
            "isFree": "🆓是否免費？",
            "isPrivateProperty": "🏨是否位於私家區域（例如單位、公司內部）？",
            "hasHook": "👚有無掛衣鈎？",
            "hasMirror": "🪞有無鏡子？",
            "hasDryer": "🌀有無吹風機？",
            "recommendation_title": "⭐推薦程度"
        }
    }
};
